(function(){
  var region;
  const epTornade='http://www.jma.go.jp/jp/radnowc/imgs/tornado/';
  // 一次細分区域ナウキャスト地域コードハッシュテーブル
  const hNowCast={
    '宗谷地方（稚内）':'201',
    '上川地方（旭川）':'201',
    '留萌地方（留萌）':'201',
    '石狩地方（札幌）':'203',
    '空知地方（岩見沢）':'203',
    '後志地方（倶知安）':'203',
    '網走地方（網走）':'202',
    '北見地方（北見）':'202',
    '紋別地方（紋別）':'202',
    '根室地方（根室）':'202',
    '釧路地方（釧路）':'202',
    '十勝地方（帯広）':'202',
    '胆振地方（室蘭）':'203',
    '日高地方（浦河）':'203',
    '渡島地方（函館）':'203',
    '檜山地方（江差）':'203',
    '津軽（青森）':'204',
    '下北（むつ）':'204',
    '三八上北（八戸）':'204',
    '沿岸（秋田）':'204',
    '内陸（横手）':'204',
    '内陸（盛岡）':'204',
    '沿岸北部（宮古）':'204',
    '沿岸南部（大船渡）':'204',
    '村山（山形）':'205',
    '置賜（米沢）':'205',
    '庄内（酒田）':'205',
    '最上（新庄）':'205',
    '東部（仙台）':'205',
    '西部（白石）':'205',
    '中通り（福島）':'205',
    '浜通り（相馬）':'205',
    '会津（若松）':'205',
    '北部（水戸）':'206',
    '南部（土浦）':'206',
    '南部（宇都宮）':'206',
    '北部（大田原）':'206',
    '南部（前橋）':'206',
    '北部（水上）':'206',
    '南部（さいたま）':'206',
    '北部（熊谷）':'206',
    '秩父地方（秩父）':'206',
    '東京地方（東京）':'206',
    '伊豆諸島北部（大島）':'206',
    '伊豆諸島南部（八丈島）':'206',
    '小笠原諸島（父島）':'210',
    '東部（横浜）':'206',
    '西部（小田原）':'206',
    '北西部（千葉）':'206',
    '北東部（銚子）':'206',
    '南部（館山）':'206',
    '中部（静岡）':'210',
    '伊豆（石廊崎）':'210',
    '東部（三島）':'210',
    '西部（浜松）':'210',
    '中・西部（甲府）':'207',
    '東部・富士五湖（河口湖）':'207',
    '下越（新潟）':'208',
    '中越（長岡）':'208',
    '上越（高田）':'208',
    '佐渡（相川）':'208',
    '北部（長野）':'207',
    '中部（松本）':'207',
    '南部（飯田）':'207',
    '東部（富山）':'209',
    '西部（伏木）':'209',
    '加賀（金沢）':'209',
    '能登（輪島）':'209',
    '嶺北（福井）':'209',
    '嶺南（敦賀）':'209',
    '美濃地方（岐阜）':'210',
    '飛騨地方（高山）':'210',
    '西部（名古屋）':'210',
    '東部（豊橋）':'210',
    '北中部（津）':'210',
    '南部（尾鷲）':'210',
    '南部（大津）':'211',
    '北部（彦根）':'211',
    '北部（舞鶴）':'211',
    '南部（京都）':'211',
    '大阪府（大阪）':'211',
    '北部（奈良）':'211',
    '南部（風屋）':'211',
    '北部（和歌山）':'211',
    '南部（潮岬）':'211',
    '南部（神戸）':'211',
    '北部（豊岡）':'211',
    '南部（岡山）':'212',
    '北部（津山）':'212',
    '東部（鳥取）':'212',
    '中・西部（米子）':'212',
    '南部（広島）':'212',
    '北部（庄原）':'212',
    '東部（松江）':'212',
    '西部（浜田）':'212',
    '隠岐（西郷）':'212',
    '西部（下関）':'214',
    '中部（山口）':'214',
    '東部（柳井）':'214',
    '北部（萩）':'214',
    '香川県（高松）':'213',
    '北部（徳島）':'213',
    '南部（日和佐）':'213',
    '中予（松山）':'213',
    '東予（新居浜）':'213',
    '南予（宇和島）':'213',
    '中部（高知）':'213',
    '東部（室戸岬）':'213',
    '西部（清水）':'213',
    '福岡地方（福岡）':'214',
    '北九州地方（八幡）':'214',
    '筑豊地方（飯塚）':'214',
    '筑後地方（久留米）':'214',
    '南部（佐賀）':'214',
    '北部（伊万里）':'214',
    '南部（長崎）':'214',
    '北部（佐世保）':'214',
    '壱岐・対馬（厳原）':'214',
    '五島（福江）':'214',
    '中部（大分）':'214',
    '北部（中津）':'214',
    '西部（日田）':'214',
    '南部（佐伯）':'214',
    '熊本地方（熊本）':'214',
    '阿蘇地方（阿蘇乙姫）':'214',
    '天草・芦北地方（牛深）':'214',
    '球磨地方（人吉）':'214',
    '南部平野部（宮崎）':'215',
    '北部平野部（延岡）':'215',
    '南部山沿い（都城）':'215',
    '北部山沿い（高千穂）':'215',
    '薩摩地方（鹿児島）':'215',
    '大隅地方（鹿屋）':'214',
    '種子島・屋久島地方（西之表）':'215',
    '奄美地方（名瀬）':'216',
    '本島中南部（那覇）':'217',
    '本島北部（名護）':'217',
    '久米島（久米島）':'217',
    '大東島地方（南大東島）':'218',
    '宮古島地方（宮古島）':'219',
    '石垣島地方（石垣島）':'219',
    '与那国島地方（与那国島）':'219'
  };

  function receiveTornade(response){
    var str=response.split('\n',10);
    var fName=str[8].split('\"');
    var url=epTornade+hNowCast[region]+'/'+fName[1];
    document.getElementById('img').setAttribute('src',url);
  }

  function getTornade(){
    chrome.runtime.sendMessage({request:"send tornade.js"},receiveTornade);
  }

  function receiveRegion(response){
      console.log(response);
      region=response;
  }

  function getRegion(){
    chrome.runtime.sendMessage({request:"send region"},receiveRegion);
  }

  function closeWin(){
    window.close();
  }

  function init(){
    document.getElementById("ok_button").addEventListener("click",closeWin);
    getRegion();
    getTornade();
  }
  window.addEventListener('DOMContentLoaded',init);
})();